wosayttn/M55M1BSP/_CUnit/dac/dac_cunit.c
/*---------------------------------------------------------------------------------------------------------*/
/* Winbond Electronics Corporation confidential                                                            */
/*                                                                                                         */
/* Copyright (c) 2007 by Winbond Electronics Corporation                                                   */
/* All rights reserved                                                                                     */
/*                                                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
/* File Contents:                                                                                          */
/*   timer_cunit_test.c                                                                                    */
/*            The test function of VIC for CUnit.                                                          */
/* Project:   DA8205                                                                                       */
/*---------------------------------------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of system headers                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>
#include "NuMicro.h"
#include "CUnit.h"
#include "Console.h"
#include "dac_cunit.h"

//#define M252G       0
//#define M258G       1

//#define M25X_VERSION   M258G

#define DAC_MODULE_NUM 2
DAC_T *g_apDACModule[DAC_MODULE_NUM] = {DAC0, DAC1};

/*---------------------------------------------------------------------------------------------------------*/
/* Define global variables and constants                                                                   */
/*---------------------------------------------------------------------------------------------------------*/
const uint16_t sine[] = {2047, 2251, 2453, 2651, 2844, 3028, 3202, 3365, 3515, 3650, 3769, 3871, 3954,
                         4019, 4064, 4088, 4095, 4076, 4040, 3984, 3908, 3813, 3701, 3573, 3429, 3272,
                         3102, 2921, 2732, 2536, 2335, 2132, 1927, 1724, 1523, 1328, 1141,  962,  794,
                         639,  497,  371,  262,  171,   99,   45,   12,    0,    7,   35,   84,  151,
                         238,  343,  465,  602,  754,  919, 1095, 1281, 1475, 1674, 1876
                        };

static uint32_t index = 0;
const uint32_t array_size = sizeof(sine) / sizeof(uint16_t);

extern uint32_t I2C_SetBusClockFreq(I2C_T *i2c, uint32_t u32BusClock);
uint32_t u32UnderRunFlag = 0;





/**
  * @brief Enable DAC group mode
  * @param[in] dac Base address of DAC module.
  * @return None
  * \hideinitializer
  */
#define DAC_ENABLE_GROUP_MODE(dac) (DAC0->CTL |= DAC_CTL_GRPEN_Msk)

/**
  * @brief Disable DAC group mode
  * @param[in] dac Base address of DAC module.
  * @return None
  * \hideinitializer
  */
#define DAC_DISABLE_GROUP_MODE(dac) (DAC0->CTL &= ~DAC_CTL_GRPEN_Msk)
/*---------------------------------------------------------------------------------------------------------*/
/* Test function                                                                                           */
/*---------------------------------------------------------------------------------------------------------*/

int suite_success_init(void)
{
    /* Enable DAC module clock */
    CLK_EnableModuleClock(DAC01_MODULE);
    return 0;
}
int suite_success_clean(void)
{
    CLK_DisableModuleClock(DAC01_MODULE) ;
    return 0;
}


/*---------------------------------------------------------------------------------------------------------*/
/* Function: function_name                                                                                 */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*               param - [in/out], parameter_description                                                   */
/*               param - [in/out], parameter_description                                                   */
/*                                                                                                         */
/* Returns:      the_value                                                                                 */
/* Side effects: the_effect                                                                                */
/* Description:                                                                                            */
/*               description                                                                               */
/*---------------------------------------------------------------------------------------------------------*/

CU_SuiteInfo DAC_suites[] =
{
    {"DAC CONST", suite_success_init, suite_success_clean, NULL, NULL, DAC_ConstTests},
    {"DAC API", suite_success_init, suite_success_clean, NULL, NULL, DAC_API_Tests},
    {"DAC API", suite_success_init, suite_success_clean, NULL, NULL, DAC_MACRO_Tests},
    CU_SUITE_INFO_NULL
};

/*---------------------------------------------------------------------------------------------------------*/
/* DAC interrupt handler                                                                                   */
/*---------------------------------------------------------------------------------------------------------*/
void DAC01_IRQHandler(void)
{
    uint32_t u32DACModule = 0 ;

    if (DAC_GET_DMAUDR_FLAG(DAC0))
    {
        CU_ASSERT(DAC_GET_DMAUDR_FLAG(DAC0) == 1);
        DAC_CLR_DMAUDR_FLAG(DAC0);
        CU_ASSERT(DAC_GET_DMAUDR_FLAG(DAC0) == 0);
        u32UnderRunFlag = 0x55555555;
    }

