wosayttn/M55M1BSP/_CUnit/dac/dac_cunit.c
    if (DAC_GET_DMAUDR_FLAG(DAC1))
    {
        CU_ASSERT(DAC_GET_DMAUDR_FLAG(DAC1) == 1);
        DAC_CLR_DMAUDR_FLAG(DAC1);
        CU_ASSERT(DAC_GET_DMAUDR_FLAG(DAC1) == 0);
        u32UnderRunFlag = 0x55555555;
    }


    if (DAC_GET_INT_FLAG(DAC0, 0))
    {
        /* Clear the DAC conversion complete finish flag */
        DAC_CLR_INT_FLAG(DAC0, 0);
        /* Enable Software trigger to start D/A conversion */
        DAC_START_CONV(DAC0);
    }

    if (DAC_GET_INT_FLAG(DAC1, 0))
    {
        /* Clear the DAC conversion complete finish flag */
        DAC_CLR_INT_FLAG(DAC1, 0);
        /* Enable Software trigger to start D/A conversion */
        DAC_START_CONV(DAC1);
    }

}

void Test_CONST_DAC_CTL(void)
{
    CU_ASSERT(DAC_CTL_LALIGN_RIGHT_ALIGN == 0);
    CU_ASSERT(DAC_CTL_LALIGN_LEFT_ALIGN == 0x400);
    CU_ASSERT(DAC_WRITE_DAT_TRIGGER == 0x00);
    CU_ASSERT(DAC_SOFTWARE_TRIGGER == (0x00 | 0x10));
    CU_ASSERT(DAC_LOW_LEVEL_TRIGGER == (0x0000 | 0x20 | 0x10));
    CU_ASSERT(DAC_HIGH_LEVEL_TRIGGER == (0x1000 | 0x20 | 0x10));
    CU_ASSERT(DAC_FALLING_EDGE_TRIGGER == (0x2000 | 0x20 | 0x10));
    CU_ASSERT(DAC_RISING_EDGE_TRIGGER == (0x3000 | 0x20 | 0x10));
    CU_ASSERT(DAC_TIMER0_TRIGGER == (0x40 | 0x10));
    CU_ASSERT(DAC_TIMER1_TRIGGER == (0x60 | 0x10));
    CU_ASSERT(DAC_TIMER2_TRIGGER == (0x80 | 0x10));
    CU_ASSERT(DAC_TIMER3_TRIGGER == (0xA0 | 0x10));
    CU_ASSERT(DAC_EPWM0_TRIGGER == (0xC0|0x10));
    CU_ASSERT(DAC_EPWM1_TRIGGER == (0xE0|0x10));
    CU_ASSERT(DAC_TRIGGER_MODE_ENABLE == 0x10);
    CU_ASSERT(DAC_TRIGGER_MODE_DISABLE == 0x00);

}
void ResetPDMA(PDMA_T *psPdma)
{
  /* Unlock protected registers */
  SYS_UnlockReg(); 
  if(psPdma == PDMA0)
   SYS_ResetModule(SYS_PDMA0RST);
  else
   SYS_ResetModule(SYS_PDMA1RST);
  /* Lock protected registers */
  SYS_LockReg();
}


void ResetDAC(uint32_t u32Module)
{
  /* Unlock protected registers */
  SYS_UnlockReg(); 
  SYS_ResetModule(SYS_DAC01RST);
  /* Lock protected registers */
  SYS_LockReg();
}
void Test_API_DAC_Open_Close(void)
{
    uint32_t u32DACModule = 0 ;

#if 0
    DAC_Open(DAC0, 0, DAC_SOFTWARE_TRIGGER);
    CU_ASSERT((DAC0->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGSEL_Msk) == (0 << DAC_CTL_TRGSEL_Pos)); //SWTRG
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC0, 0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACEN_Msk) == 0);
    DAC_Open(DAC1, 0, DAC_SOFTWARE_TRIGGER);
    CU_ASSERT((DAC1->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGSEL_Msk) == (0 << DAC_CTL_TRGSEL_Pos)); //SWTRG
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC1, 0);
#else

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_SOFTWARE_TRIGGER);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGSEL_Msk) == (0 << DAC_CTL_TRGSEL_Pos)); //SWTRG
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif

#if 0
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACEN_Msk) == 0);
    DAC_Open(DAC0, 0, DAC_LOW_LEVEL_TRIGGER);
    CU_ASSERT((DAC0->CTL & DAC_CTL_ETRGSEL_Msk) == (0 << DAC_CTL_ETRGSEL_Pos)); //Low Level trigger
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC0, 0);
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACEN_Msk) == 0);
    DAC_Open(DAC1, 0, DAC_LOW_LEVEL_TRIGGER);
    CU_ASSERT((DAC1->CTL & DAC_CTL_ETRGSEL_Msk) == (0 << DAC_CTL_ETRGSEL_Pos)); //Low Level trigger
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC1, 0);
#else

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == 0);
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_LOW_LEVEL_TRIGGER);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_ETRGSEL_Msk) == (0 << DAC_CTL_ETRGSEL_Pos)); //Low Level trigger
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
#if 0
    DAC_Open(DAC0, 0, DAC_HIGH_LEVEL_TRIGGER);
    CU_ASSERT((DAC0->CTL & DAC_CTL_ETRGSEL_Msk) == (1 << DAC_CTL_ETRGSEL_Pos)); //Hi Level trigger
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC0, 0);
    DAC_Open(DAC1, 0, DAC_HIGH_LEVEL_TRIGGER);
    CU_ASSERT((DAC1->CTL & DAC_CTL_ETRGSEL_Msk) == (1 << DAC_CTL_ETRGSEL_Pos)); //Hi Level trigger
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC1, 0);
#else

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_HIGH_LEVEL_TRIGGER);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_ETRGSEL_Msk) == (1 << DAC_CTL_ETRGSEL_Pos)); //Hi Level trigger
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
#if 0
    DAC_Open(DAC0, 0, DAC_FALLING_EDGE_TRIGGER);
    CU_ASSERT((DAC0->CTL & DAC_CTL_ETRGSEL_Msk) == (2 << DAC_CTL_ETRGSEL_Pos)); //Falling edge trigger
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC0, 0);
    DAC_Open(DAC1, 1, DAC_FALLING_EDGE_TRIGGER);
    CU_ASSERT((DAC1->CTL & DAC_CTL_ETRGSEL_Msk) == (2 << DAC_CTL_ETRGSEL_Pos)); //Falling edge trigger
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC1, 0);
#else

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_FALLING_EDGE_TRIGGER);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_ETRGSEL_Msk) == (2 << DAC_CTL_ETRGSEL_Pos)); //Falling edge trigger
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
#if 0
    DAC_Open(DAC0, 0, DAC_RISING_EDGE_TRIGGER);
    CU_ASSERT((DAC0->CTL & DAC_CTL_ETRGSEL_Msk) == (3 << DAC_CTL_ETRGSEL_Pos)); //Rising edge trigger
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC0, 0);
    DAC_Open(DAC1, 1, DAC_RISING_EDGE_TRIGGER);
    CU_ASSERT((DAC1->CTL & DAC_CTL_ETRGSEL_Msk) == (3 << DAC_CTL_ETRGSEL_Pos)); //Rising edge trigger
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC1, 0);
#else

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_RISING_EDGE_TRIGGER);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_ETRGSEL_Msk) == (3 << DAC_CTL_ETRGSEL_Pos)); //Rising edge trigger
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGSEL_Msk) == (1 << DAC_CTL_TRGSEL_Pos));   //External STDAC
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
#if 0
    DAC_Open(DAC0, 0, DAC_TIMER0_TRIGGER);
    CU_ASSERT((DAC0->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGSEL_Msk) == (2 << DAC_CTL_TRGSEL_Pos)); //Timer0TRG
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC0, 0);
    DAC_Open(DAC1, 1, DAC_TIMER0_TRIGGER);
    CU_ASSERT((DAC1->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGSEL_Msk) == (2 << DAC_CTL_TRGSEL_Pos)); //Timer0TRG
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC1, 0);
#else

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_TIMER0_TRIGGER);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGSEL_Msk) == (2 << DAC_CTL_TRGSEL_Pos)); //Timer0TRG
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
#if 0
    DAC_Open(DAC0, 0, DAC_TIMER1_TRIGGER);
    CU_ASSERT((DAC0->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGSEL_Msk) == (3 << DAC_CTL_TRGSEL_Pos)); //Timer1TRG
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC0, 0);
    DAC_Open(DAC1, 0, DAC_TIMER1_TRIGGER);
    CU_ASSERT((DAC1->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGSEL_Msk) == (3 << DAC_CTL_TRGSEL_Pos)); //Timer1TRG
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC1, 0);
#else

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_TIMER1_TRIGGER);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGSEL_Msk) == (3 << DAC_CTL_TRGSEL_Pos)); //Timer1TRG
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
#if 0
    DAC_Open(DAC0, 0, DAC_TIMER2_TRIGGER);
    CU_ASSERT((DAC0->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGSEL_Msk) == (4 << DAC_CTL_TRGSEL_Pos)); //Timer2TRG
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC0, 0);
    DAC_Open(DAC1, 0, DAC_TIMER2_TRIGGER);
    CU_ASSERT((DAC1->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGSEL_Msk) == (4 << DAC_CTL_TRGSEL_Pos)); //Timer2TRG
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC1, 0);
#else

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_TIMER2_TRIGGER);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGSEL_Msk) == (4 << DAC_CTL_TRGSEL_Pos)); //Timer2TRG
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
#if 0
    DAC_Open(DAC0, 0, DAC_TIMER3_TRIGGER);
    CU_ASSERT((DAC0->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC0->CTL & DAC_CTL_TRGSEL_Msk) == (5 << DAC_CTL_TRGSEL_Pos)); //Timer3TRG
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC0, 0);
    DAC_Open(DAC1, 0, DAC_TIMER3_TRIGGER);
    CU_ASSERT((DAC1->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
    CU_ASSERT((DAC1->CTL & DAC_CTL_TRGSEL_Msk) == (5 << DAC_CTL_TRGSEL_Pos)); //Timer3TRG
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
    DAC_Close(DAC1, 0);
#else

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_TIMER3_TRIGGER);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGSEL_Msk) == (5 << DAC_CTL_TRGSEL_Pos)); //Timer3TRG
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
#if 1 //TC8237 DAC is not supported PWM trigger

    for (u32DACModule = 0 ; u32DACModule ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_EPWM0_TRIGGER);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGSEL_Msk) == (6 << DAC_CTL_TRGSEL_Pos)); //PWM0TRG
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

    for (u32DACModule = 0 ; u32DACModule ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_EPWM1_TRIGGER);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_ETRGSEL_Msk) == 0);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGEN_Msk) == DAC_CTL_TRGEN_Msk);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_TRGSEL_Msk) == (7 << DAC_CTL_TRGSEL_Pos)); //PWM1TRG
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACEN_Msk) == DAC_CTL_DACEN_Msk);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif

