wosayttn/M55M1BSP/_CUnit/dac/dac_cunit.c
}

void Test_API_DAC_DelayTime(void)
{
    int i, u32DACModule;
#if 0
    DAC_Open(DAC0, 0, DAC_SOFTWARE_TRIGGER);

    //Note: 160M, DAC0->TCTL MAX value is 6
    for (i = 0; i < 6; i++)
    {
        CU_ASSERT(DAC_SetDelayTime(DAC0, i) == i);
    }

    DAC_Close(DAC0, 0);
    DAC_Open(DAC1, 0, DAC_SOFTWARE_TRIGGER);

    //Note: 160M, DAC0->TCTL MAX value is 6
    for (i = 0; i < 6; i++)
    {
        CU_ASSERT(DAC_SetDelayTime(DAC1, i) == i);
    }

    DAC_Close(DAC1, 0);
#else

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_SOFTWARE_TRIGGER);

        for (i = 0; i < 6; i++)
        {
            CU_ASSERT(DAC_SetDelayTime(g_apDACModule[u32DACModule], i) == i);
        }

        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
}

void Test_MACRO_DAC_Align(void)
{
    uint32_t u32DACModule ;
#if 0
    DAC_Open(DAC0, 0, DAC_SOFTWARE_TRIGGER);
    DAC_ENABLE_LEFT_ALIGN(DAC0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_LALIGN_Msk) == DAC_CTL_LALIGN_Msk);
    DAC_ENABLE_RIGHT_ALIGN(DAC0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_LALIGN_Msk) == 0);
    DAC_Close(DAC0, 0);
    DAC_Open(DAC1, 0, DAC_SOFTWARE_TRIGGER);
    DAC_ENABLE_LEFT_ALIGN(DAC1);
    CU_ASSERT((DAC1->CTL & DAC_CTL_LALIGN_Msk) == DAC_CTL_LALIGN_Msk);
    DAC_ENABLE_RIGHT_ALIGN(DAC1);
    CU_ASSERT((DAC1->CTL & DAC_CTL_LALIGN_Msk) == 0);
    DAC_Close(DAC1, 0);
#else

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_SOFTWARE_TRIGGER);
        DAC_ENABLE_LEFT_ALIGN(g_apDACModule[u32DACModule]);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_LALIGN_Msk) == DAC_CTL_LALIGN_Msk);
        DAC_ENABLE_RIGHT_ALIGN(g_apDACModule[u32DACModule]);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_LALIGN_Msk) == 0);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
}

void Test_MACRO_DAC_BYPASS_BUF(void)
{

#if 0
    DAC_Open(DAC0, 0, DAC_SOFTWARE_TRIGGER);
    DAC_ENABLE_BYPASS_BUFFER(DAC0);
    CU_ASSERT(((DAC0->CTL)&DAC_CTL_BYPASS_Msk) == DAC_CTL_BYPASS_Msk);
    DAC_DISABLE_BYPASS_BUFFER(DAC0);
    CU_ASSERT(((DAC0->CTL)&DAC_CTL_BYPASS_Msk) == 0);
    DAC_Close(DAC0, 0);
    DAC_Open(DAC1, 0, DAC_SOFTWARE_TRIGGER);
    DAC_ENABLE_BYPASS_BUFFER(DAC1);
    CU_ASSERT(((DAC1->CTL)&DAC_CTL_BYPASS_Msk) == DAC_CTL_BYPASS_Msk);
    DAC_DISABLE_BYPASS_BUFFER(DAC1);
    CU_ASSERT(((DAC1->CTL)&DAC_CTL_BYPASS_Msk) == 0);
    DAC_Close(DAC1, 0);
#else
    uint32_t u32DACModule ;

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_SOFTWARE_TRIGGER);
        DAC_ENABLE_BYPASS_BUFFER(g_apDACModule[u32DACModule]);
        CU_ASSERT(((g_apDACModule[u32DACModule]->CTL)&DAC_CTL_BYPASS_Msk) == DAC_CTL_BYPASS_Msk);
        DAC_DISABLE_BYPASS_BUFFER(g_apDACModule[u32DACModule]);
        CU_ASSERT(((g_apDACModule[u32DACModule]->CTL)&DAC_CTL_BYPASS_Msk) == 0);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
}

void Test_MACRO_DAC_DMA_INT(void)
{
#if 0
    DAC_Open(DAC0, 0, DAC_SOFTWARE_TRIGGER);

    CU_ASSERT((DAC0->CTL & DAC_CTL_DMAURIEN_Msk) == 0);
    DAC_ENABLE_DMAUDR_INT(DAC0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_DMAURIEN_Msk) == DAC_CTL_DMAURIEN_Msk);
    DAC_DISABLE_DMAUDR_INT(DAC0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_DMAURIEN_Msk) == 0);

    CU_ASSERT((DAC0->CTL & DAC_CTL_DMAEN_Msk) == 0);
    DAC_ENABLE_PDMA(DAC0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_DMAEN_Msk) == DAC_CTL_DMAEN_Msk);
    DAC_DISABLE_PDMA(DAC0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_DMAEN_Msk) == 0);

    CU_ASSERT((DAC0->CTL & DAC_CTL_DACIEN_Msk) == 0);
    DAC_ENABLE_INT(DAC0, 0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACIEN_Msk) == DAC_CTL_DACIEN_Msk);
    DAC_DISABLE_INT(DAC0, 0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_DACIEN_Msk) == 0);

    DAC_Close(DAC0, 0);

    DAC_Open(DAC1, 0, DAC_SOFTWARE_TRIGGER);

    CU_ASSERT((DAC1->CTL & DAC_CTL_DMAURIEN_Msk) == 0);
    DAC_ENABLE_DMAUDR_INT(DAC1);
    CU_ASSERT((DAC1->CTL & DAC_CTL_DMAURIEN_Msk) == DAC_CTL_DMAURIEN_Msk);
    DAC_DISABLE_DMAUDR_INT(DAC1);
    CU_ASSERT((DAC1->CTL & DAC_CTL_DMAURIEN_Msk) == 0);

    CU_ASSERT((DAC1->CTL & DAC_CTL_DMAEN_Msk) == 0);
    DAC_ENABLE_PDMA(DAC1);
    CU_ASSERT((DAC1->CTL & DAC_CTL_DMAEN_Msk) == DAC_CTL_DMAEN_Msk);
    DAC_DISABLE_PDMA(DAC1);
    CU_ASSERT((DAC1->CTL & DAC_CTL_DMAEN_Msk) == 0);

    CU_ASSERT((DAC1->CTL & DAC_CTL_DACIEN_Msk) == 0);
    DAC_ENABLE_INT(DAC1, 0);
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACIEN_Msk) == DAC_CTL_DACIEN_Msk);
    DAC_DISABLE_INT(DAC1, 0);
    CU_ASSERT((DAC1->CTL & DAC_CTL_DACIEN_Msk) == 0);

    DAC_Close(DAC1, 0);
#else
    uint32_t u32DACModule ;

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_SOFTWARE_TRIGGER);

        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DMAURIEN_Msk) == 0);
        DAC_ENABLE_DMAUDR_INT(g_apDACModule[u32DACModule]);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DMAURIEN_Msk) == DAC_CTL_DMAURIEN_Msk);
        DAC_DISABLE_DMAUDR_INT(g_apDACModule[u32DACModule]);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DMAURIEN_Msk) == 0);

        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DMAEN_Msk) == 0);
        DAC_ENABLE_PDMA(g_apDACModule[u32DACModule]);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DMAEN_Msk) == DAC_CTL_DMAEN_Msk);
        DAC_DISABLE_PDMA(g_apDACModule[u32DACModule]);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DMAEN_Msk) == 0);

        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACIEN_Msk) == 0);
        DAC_ENABLE_INT(g_apDACModule[u32DACModule], 0);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACIEN_Msk) == DAC_CTL_DACIEN_Msk);
        DAC_DISABLE_INT(g_apDACModule[u32DACModule], 0);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DACIEN_Msk) == 0);
        DAC_Close(g_apDACModule[u32DACModule], 0);
        ResetDAC(u32DACModule) ;
    }

#endif
}

void Test_MACRO_DAC_RW_Data(void)
{
#if 0
    index = 0;
    NVIC_DisableIRQ(DAC_IRQn);
    DAC_Open(DAC0, 0, DAC_SOFTWARE_TRIGGER);
    DAC_SetDelayTime(DAC0, 6);

    DAC_WRITE_DATA(DAC0, 0, sine[index]);
    CU_ASSERT(DAC0->DAT == sine[index]);
    CU_ASSERT(DAC_READ_DATA(DAC0, 0) == sine[index]);
    DAC_CLR_INT_FLAG(DAC0, 0);
    CU_ASSERT((DAC0->STATUS & DAC_STATUS_FINISH_Msk) == 0);
    DAC_START_CONV(DAC0);

    /* Below test code maybe cannot get SWTRG=1, it is too fast */
    //CU_ASSERT((DAC0->SWTRG & DAC_SWTRG_SWTRG_Msk)==DAC_SWTRG_SWTRG_Msk);

