wosayttn/M55M1BSP/_CUnit/dac/dac_cunit.c
    CU_ASSERT(DAC_IS_BUSY(DAC0, 0) == 1);
    CU_ASSERT((DAC0->STATUS & DAC_STATUS_BUSY_Msk) == DAC_STATUS_BUSY_Msk);

    while (DAC_GET_INT_FLAG(DAC0, 0) == 0);

    CU_ASSERT(DAC_GET_INT_FLAG(DAC0, 0) == DAC_STATUS_FINISH_Msk);
    CU_ASSERT((DAC0->STATUS & DAC_STATUS_FINISH_Msk) == DAC_STATUS_FINISH_Msk);
    CU_ASSERT((DAC0->SWTRG & DAC_SWTRG_SWTRG_Msk) == 0);

    DAC_CLR_INT_FLAG(DAC0, 0);
    CU_ASSERT((DAC0->STATUS & DAC_STATUS_FINISH_Msk) == 0);

    DAC_Close(DAC0, 0);
    SYS_ResetModule(DAC_RST);
#else
    uint32_t u32DACModule ;

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        index = 0;
        NVIC_DisableIRQ(DAC01_IRQn);
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_SOFTWARE_TRIGGER);
        DAC_SetDelayTime(g_apDACModule[u32DACModule], 6);

        DAC_WRITE_DATA(g_apDACModule[u32DACModule], 0, sine[index]);
        CU_ASSERT(g_apDACModule[u32DACModule]->DAT == sine[index]);
        CU_ASSERT(DAC_READ_DATA(g_apDACModule[u32DACModule], 0) == sine[index]);
        DAC_CLR_INT_FLAG(g_apDACModule[u32DACModule], 0);
        CU_ASSERT((g_apDACModule[u32DACModule]->STATUS & DAC_STATUS_FINISH_Msk) == 0);
        DAC_START_CONV(g_apDACModule[u32DACModule]);

        /* Below test code maybe cannot get SWTRG=1, it is too fast */
        //CU_ASSERT((DAC0->SWTRG & DAC_SWTRG_SWTRG_Msk)==DAC_SWTRG_SWTRG_Msk);

        CU_ASSERT(DAC_IS_BUSY(g_apDACModule[u32DACModule], 0) == 1);
        CU_ASSERT((g_apDACModule[u32DACModule]->STATUS & DAC_STATUS_BUSY_Msk) == DAC_STATUS_BUSY_Msk);

        while (DAC_GET_INT_FLAG(g_apDACModule[u32DACModule], 0) == 0) {};

        CU_ASSERT(DAC_GET_INT_FLAG(g_apDACModule[u32DACModule], 0) == DAC_STATUS_FINISH_Msk);

        CU_ASSERT((g_apDACModule[u32DACModule]->STATUS & DAC_STATUS_FINISH_Msk) == DAC_STATUS_FINISH_Msk);

        CU_ASSERT((g_apDACModule[u32DACModule]->SWTRG & DAC_SWTRG_SWTRG_Msk) == 0);

        DAC_CLR_INT_FLAG(g_apDACModule[u32DACModule], 0);

        CU_ASSERT((g_apDACModule[u32DACModule]->STATUS & DAC_STATUS_FINISH_Msk) == 0);

        DAC_Close(g_apDACModule[u32DACModule], 0);

        ResetDAC(u32DACModule) ;
    }

#endif
}

void Test_MACRO_DAC_SW_PDMA(void)
{
#if 0
    uint32_t u32ExitCnt;

    /* Reset DAC module */
    SYS_ResetModule(DAC_RST);
    /* Enable PDMA clock source */
    CLK_EnableModuleClock(PDMA_MODULE);
    /* Reset PDMA module */
    SYS_ResetModule(PDMA_RST);
    /* Open PDMA Channel 0 */
    PDMA_Open(0x1);
    /* Set transfer data width, and tranfer count */
    PDMA_SetTransferCnt(0, PDMA_WIDTH_16, array_size);
    /* transfer width is one word(32 bit) */
    PDMA_SetTransferAddr(0, (uint32_t)&sine[index], PDMA_SAR_INC, (uint32_t)&DAC0->DAT, PDMA_DAR_FIX);
    /* Select channel 0 request source from DAC */
    PDMA_SetTransferMode(0, PDMA_DAC0_TX, FALSE, 0);
    /* Set transfer type and burst size */
    PDMA_SetBurstType(0, PDMA_REQ_SINGLE, PDMA_BURST_128);
    /* Set the software trigger,enable DAC even trigger mode and enable D/A converter */
    DAC_Open(DAC0, 0, DAC_SOFTWARE_TRIGGER);
    /* The DAC conversion settling time is 8us */
    DAC_SetDelayTime(DAC0, 6);
    /* Clear the DAC conversion complete finish flag for safe */
    DAC_CLR_INT_FLAG(DAC0, 0);
    /* Enable the PDMA Mode */
    DAC_ENABLE_PDMA(DAC0);
    /* Enable the DAC interrupt.  */
    CU_ASSERT((DAC0->CTL & DAC_CTL_DMAURIEN_Msk) == 0);
    DAC_ENABLE_DMAUDR_INT(DAC0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_DMAURIEN_Msk) == DAC_CTL_DMAURIEN_Msk);
    DAC_ENABLE_INT(DAC0, 0);
    NVIC_EnableIRQ(DAC_IRQn);

    CLK_SysTickDelay(1000);
    u32ExitCnt = 0;
    u32UnderRunFlag = 0;
    /* Enable Software trigger to start D/A conversion */
    DAC_START_CONV(DAC0);

    while (1)
    {
        if (PDMA_GET_TD_STS() == 0x1)
        {
            u32ExitCnt++;
            /* Re-Set transfer count and basic operation mode */
            PDMA_SetTransferCnt(0, PDMA_WIDTH_16, array_size);
            PDMA_SetTransferMode(0, PDMA_DAC0_TX, FALSE, 0);

            /* Clear PDMA channel 0 transfer done flag */
            PDMA_CLR_TD_FLAG(0x1);
        }
        else
        {
            DAC_START_CONV(DAC0);
        }

        if ((u32ExitCnt > 100) | (u32UnderRunFlag == 0x55555555))
        {
            break;
        }
    }

    CU_ASSERT((DAC0->CTL & DAC_CTL_DMAURIEN_Msk) == DAC_CTL_DMAURIEN_Msk);
    DAC_DISABLE_DMAUDR_INT(DAC0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_DMAURIEN_Msk) == 0);
    /* Disable External Interrupt */
    NVIC_DisableIRQ(DAC_IRQn);

    /* Reset PDMA module */
    SYS_ResetModule(PDMA_RST);

    /* Reset DAC module */
    SYS_ResetModule(DAC_RST);

    /* Disable PDMA IP clock */
    CLK_DisableModuleClock(PDMA_MODULE);
#else
    uint32_t u32ExitCnt;
    uint32_t u32DACModule ;

    for (u32DACModule = 0 ; u32DACModule < DAC_MODULE_NUM ; u32DACModule++)
    {
        /* Reset DAC module */
        ResetDAC(u32DACModule) ;
        /* Enable PDMA clock source */
        CLK_EnableModuleClock(PDMA0_MODULE);
        /* Reset PDMA module */
         ResetPDMA(PDMA0);
        /* Open PDMA Channel 0 */
        PDMA_Open(PDMA0, 0x1);
        /* Set transfer data width, and tranfer count */
        PDMA_SetTransferCnt(PDMA0, 0, PDMA_WIDTH_16, array_size);
        /* transfer width is one word(32 bit) */
        PDMA_SetTransferAddr(PDMA0, 0, (uint32_t)&sine[index], PDMA_SAR_INC, (uint32_t)&g_apDACModule[u32DACModule]->DAT, PDMA_DAR_FIX);


       if (u32DACModule == 0)
            /* Select channel 0 request source from DAC */
            PDMA_SetTransferMode(PDMA0, 0, PDMA_DAC0_TX, FALSE, 0);
        else
            /* Select channel 0 request source from DAC */
            PDMA_SetTransferMode(PDMA1, 0, PDMA_DAC1_TX, FALSE, 0);


        /* Set transfer type and burst size */
        PDMA_SetBurstType(PDMA0, 0, PDMA_REQ_SINGLE, PDMA_BURST_128);
        /* Set the software trigger,enable DAC even trigger mode and enable D/A converter */
        DAC_Open(g_apDACModule[u32DACModule], 0, DAC_SOFTWARE_TRIGGER);
        /* The DAC conversion settling time is 8us */
        DAC_SetDelayTime(g_apDACModule[u32DACModule], 6);
        /* Clear the DAC conversion complete finish flag for safe */
        DAC_CLR_INT_FLAG(g_apDACModule[u32DACModule], 0);
        /* Enable the PDMA Mode */
        DAC_ENABLE_PDMA(g_apDACModule[u32DACModule]);
        /* Enable the DAC interrupt.  */
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DMAURIEN_Msk) == 0);
        DAC_ENABLE_DMAUDR_INT(g_apDACModule[u32DACModule]);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DMAURIEN_Msk) == DAC_CTL_DMAURIEN_Msk);
        DAC_ENABLE_INT(g_apDACModule[u32DACModule], 0);
        NVIC_EnableIRQ(DAC01_IRQn);

        CLK_SysTickDelay(1000);
        u32ExitCnt = 0;
        u32UnderRunFlag = 0;
        /* Enable Software trigger to start D/A conversion */
        DAC_START_CONV(g_apDACModule[u32DACModule]);

        while (1)
        {
            if (PDMA_GET_TD_STS(PDMA0) == 0x1)
            {
                u32ExitCnt++;
                /* Re-Set transfer count and basic operation mode */
                PDMA_SetTransferCnt(PDMA0, 0, PDMA_WIDTH_16, array_size);
                PDMA_SetTransferMode(PDMA0, 0, PDMA_DAC0_TX, FALSE, 0);

                /* Clear PDMA channel 0 transfer done flag */
                PDMA_CLR_TD_FLAG(PDMA0, 0x1);
            }
            else
            {
                DAC_START_CONV(g_apDACModule[u32DACModule]);
            }

            if ((u32ExitCnt > 100) | (u32UnderRunFlag == 0x55555555))
            {
                break;
            }
        }

        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DMAURIEN_Msk) == DAC_CTL_DMAURIEN_Msk);
        DAC_DISABLE_DMAUDR_INT(g_apDACModule[u32DACModule]);
        CU_ASSERT((g_apDACModule[u32DACModule]->CTL & DAC_CTL_DMAURIEN_Msk) == 0);
        /* Disable External Interrupt */
        NVIC_DisableIRQ(DAC01_IRQn);

        /* Reset PDMA module */
        SYS_ResetModule(SYS_PDMA0RST);

        /* Reset DAC module */
        ResetDAC(u32DACModule) ;

        /* Disable PDMA IP clock */
        CLK_DisableModuleClock(PDMA0_MODULE);
    }

#endif
}

void Test_MACRO_DAC_GROUP_MODE(void)
{
    // TC8237 DAC is not supported this function
    DAC_ENABLE_GROUP_MODE(DAC0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_GRPEN_Msk) == DAC_CTL_GRPEN_Msk);
    DAC_DISABLE_GROUP_MODE(DAC0);
    CU_ASSERT((DAC0->CTL & DAC_CTL_GRPEN_Msk) == 0);
    DAC_ENABLE_GROUP_MODE(DAC1);
    CU_ASSERT((DAC0->CTL & DAC_CTL_GRPEN_Msk) == DAC_CTL_GRPEN_Msk);
    DAC_DISABLE_GROUP_MODE(DAC1);
    CU_ASSERT((DAC0->CTL & DAC_CTL_GRPEN_Msk) == 0);

}


CU_TestInfo DAC_ConstTests[] =
{
    {" 1: CONST DAC_CTL.", Test_CONST_DAC_CTL},
    CU_TEST_INFO_NULL
};

CU_TestInfo DAC_API_Tests[] =
{
    {" 1: API DAC_Open&Close", Test_API_DAC_Open_Close},
    {" 2: API DAC_DelayTime", Test_API_DAC_DelayTime},
    CU_TEST_INFO_NULL
};

CU_TestInfo DAC_MACRO_Tests[] =
{
    {" 1: MACRO DAC_Open&Close", Test_MACRO_DAC_Align},
    {" 2: MACRO DAC_BPASS_BUF", Test_MACRO_DAC_BYPASS_BUF},
    {" 3: MACRO DAC_INT", Test_MACRO_DAC_DMA_INT},
    {" 4: MACRO DAC_Read/Write", Test_MACRO_DAC_RW_Data},
    {" 5: MACRO DAC0_SW_PDMA", Test_MACRO_DAC_SW_PDMA},
    {" 6: MACRO Group Mode", Test_MACRO_DAC_GROUP_MODE},

    CU_TEST_INFO_NULL
};
